Revit 2024 API
ParameterTypeId.ViewSolarstudyCurrentStudyTypeIndex Property
 "Study type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId ViewSolarstudyCurrentStudyTypeIndex { get; }
Visual Basic
Public Shared ReadOnly Property ViewSolarstudyCurrentStudyTypeIndex As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ ViewSolarstudyCurrentStudyTypeIndex {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace